//给定每头牛的重量和强壮程度，安排叠放顺序，使所有牛中最大的风险值（上方牛总重量减自身强壮程度）最小。
// 交换论证：
//            第i个位置上的牛              第i+1个位置上的牛
// 交换前：w1+w2+...+w(i-1)-si        w1+...+wi-s(i+1)
// 交换后：w1+...+w(i-1)-s(i+1)       w1+...+w(i-1)+w(i+1)-si
// 这两个有很多重复的项，我们同时加减上这些项得到：
//            第i个位置上的牛              第i+1个位置上的牛
// 交换前：      s(i+1)                       wi+si
// 交换后：       s(i)                   w(i+1)+s(i+1)
// 也就是说如果相邻的两个位置只要是逆序（交换前i的w+s比i+1的大），交换完之后这两个位置的风险值不会变的更大。
// 所以按照w+s来从小到大排序，排完序整体最优

// 反思：猜怎么排序属于设计贪心，但是这道题很难猜。交换论证属于证明贪心，这题我们反过来从交换论证推到贪心策略。
//       也就是说凭直觉猜很重要，但是证明也很重要，因为不是所有的题都能直接猜出来的
const int N =50010;
const int INF=0x3f3f3f3f;
int n;
struct cow
{
    int w,s;
}a[N];

int main()
{
    cin >> n;
    for(int i=1;i<=n;i++) cin >> a[i].w >> a[i].s;
    sort(a+1,a+1+n,[](const cow &a,const cow &b){
        return a.w+a.s<b.w+b.s;
    });
    ll ans=-INF;//这个一定不能是0，因为s可能为负数
    ll sum=0;
    for(int i=1;i<=n;i++)
    {
        ans=max(ans,sum-a[i].s);
        sum+=a[i].w;//这个不要放在上面，应该先更新再加上
    }
    cout << ans;

    return 0;
}