//依次输出质因数的底数和指数
void f(int n)
{
    for(int i=2;i<=n/i;i++)//优化：大于根号n的质因数只能有一个，放在最后判断一下
    {
        /*
        这里不用考虑合数，因为遍历到i的时候前面的质因数全都被除干净了。
        现在n%i==0。如果i是合数，那么它可以分解成质因数相乘，那么n肯定也是这些质因数的倍数，说明n没有把这些质因数除干净，
        所以只要n%i==0，i一定是质数
        */
        if(n%i==0)
        {
            int s=0;
            while(n%i==0)
            {
                s++;
                n/=i;
            }
            cout << i << ' ' << s << '\n';
        }
    }
    if(n>1) cout << n << ' ' << 1 << '\n';//最后的判断
}
